app/controllers/manage_controller.rb

SELECT "projects".* FROM "projects"
---
  def projects
    @projects = Project.all