app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."owner_id" = ? ORDER BY "projects"."created_at" DESC  [["owner_id", 1]]
---
  def index
    @projects = Project.where(owner_id: current_user.id)
                       .order(created_at: :desc)

INSERT INTO "projects" ("title", "description", "created_at", "updated_at", "owner_id") VALUES (?, ?, ?, ?, ?)  [["title", "This is a test"], ["description", "ksljdlksdf"], ["created_at", "2018-01-16 20:07:32.339196"], ["updated_at", "2018-01-16 20:07:32.339196"], ["owner_id", 1]]
---
  def create
    @project = Project.new(project_params)
    @project.owner_id = current_user.id;

    if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "Some dumber project"], ["updated_at", "2017-10-09 20:52:34.989383"], ["id", 1]]
---
  def update
    @project = Project.find(params[:id])

    if @project.update(project_params)